[
    {
    "id": 1,
    "title": "Learn to Love What You Have",
    "author": "Nick Neirotti",
    "hook": "Can we learn to embrace the present moment without judgment? How can we close the gap between what we have and what we want?",
    "summaryPoints": ["Loving what you already have (and accepting what you don’t!!!) is the only way to remove yourself from the hedonic treadmill.", "Seek the silver linings in your setbacks by adopting an optimistic frame."],    
    "sections": [
      {
        "title": "Elaboration",
        "content": "\tWe are evolutionarily programmed to seek others' approval and are equally prone to jealousy. People showcase idealized versions of their lives for admiration, which only exacerbates the culture of comparison and FOMO. Basing your worth and happiness on others' approval invariably leads to a desire for more and better. How can one be content when nothing seems good enough?\n\n\tThe hedonic treadmill theory suggests that regardless of our circumstances, from losing a job to winning the lottery, we tend to return to a baseline level of happiness. This doesn’t mean you should quit your job with the expectation of being just as happy living on the streets. Goals and aspirations are important because they provide direction among other things; however, it's misguided to believe that reaching the proverbial pot of gold at the end of the rainbow will finally make you happy. What's preventing you from feeling that way now?\n\n\tThe disparity between expressions on a sunny day and a cloudy one is remarkable. It's as if you could predict the weather given a collection of headshots. However, stormy days are inevitable; are our emotions forever bound to circumstance? The first practice I advocate for is consistently seeking the silver lining in every storm cloud. This habit encourages us to recognize growth opportunities in all situations. By identifying the positives in challenging times, we condition our minds to value the present and discover joy in our journey. Understand that there are things we can control and things we can't. Worrying about things beyond our reach is a waste of time and simply makes us feel bad for no reason.\n\n\tImagine life as an art gallery filled with paintings that depict your daily experiences.  As the manager of this fine establishment, you may have limited control over which paintings you acquire, but the way you frame them is entirely up to you. While some frames can detract from a painting's beauty, others can enhance it significantly. Here are a few framing perspectives you might consider:\n\n* Adventure Frame: See life as an exciting journey, embracing challenges and joys as part of a grand adventure.\n* Comedic Frame: “Laughter, and a lot of it, is the right response to the things which drive us to tears” - Seneca\n* Gratitude Frame: There are things to be thankful for in every situation.\n* Growth Frame: Challenging experiences are great opportunities for growth.\n* Incompetence vs. Malice: \"When you wake up in the morning, tell yourself: the people I deal with today will be meddling, ungrateful, arrogant, dishonest, jealous and surly. They are like this because they can't tell good from evil. But I have seen the beauty of good, and the ugliness of evil, and have recognized that the wrongdoer has a nature related to my own - not of the same blood and birth, but the same mind, and possessing a share of the divine. And so none of them can hurt me.\" - Marcus Aurelius\n* Possibility Frame: Open-minded to the possibilities the situation might bring.\n*Prospective Restrospection: Think nostalgically about the present because these are the good ol' days despite their shortcomings.\n* Storytelling Frame: “This is gonna make my autobiography go crazy, bro.” - Sr. Frijoles"
      }],
    "resources": [
    {"title": "Meditations by Marcus Aurelius, Gregory Hays", "url": "https://www.goodreads.com/book/show/57024113-meditations", "description": "A collection of personal writings by the Roman Emperor, offering profound reflections and practical guidance on Stoic philosophy, self-discipline, and virtuous living"},
    {"title": "The Stoic Path by William B. Irvine", "url": "https://dynamic.wakingup.com/pack/PK7REQC", "description": "Podcast series on the Waking Up app" },
    {"title": "Hedonic Adaptation | Why You'll Never Have Enough In Life by MindfulThinks", "url": "https://www.youtube.com/watch?v=SdJSjj2A710", "description": "2 minute elaboration on hedonic treadmill theory"},
    {"title": "The Rich and How They Got That Way by Cynthia Crossen", "url": "https://www.goodreads.com/en/book/show/41635", "description": "Book analysing the wealthy of different generations"}
    ],
    "quotes": [
      {"quote": "\"If I am what I have, and if what I have is lost, who then am I?\" - Cynthia Crossen"},
      {"quote": "\"Everything you're trying to reach - by taking the long way around - you could have right now, this moment.\" - Marcus Aurelius"},
      {"quote": "\"The next time you're feeling sorry for yourself, remember there is someone far worse... Wouldn't it be great to have running water, your health, your situation, your relationships?\" - William B. Irvine"},
      {"quote": "\"Wealth consists not in having great possessions, but in having few wants.\" - Cynthia Crossen"},
      {"quote": "\"You can live here as you expect to live there.\" - Marcus Aurelius"}],
    "youtubeID": "pGrxc_GsZJM",
    "subcategory": "Philosophy",
    "subject": "Stoicism",
    "datePosted": "2024-04-01T14:48:00Z",
    "status": "published",
    "relatedPosts": [2],
    "featured": true
  }
]
